{"pageProps":{"products":[{"category":"Pet Supplies","brand":"Burt's Bees","productName":"Burt's Bees for Cats Natural Dander Reducing Wipes | Kitten and Cat Wipes for Grooming | Cruelty Free, Sulfate & Paraben Free, pH Balanced for Cats - Made in USA - 2 Pack ","priceRange":"20-22","itemCode":"Item # BB112","quantity":"120","minimumOrder":"10","description":"Burt's Bees has been a pioneer in developing nature-friendly health and beauty care products for over thirty years. We believe that pets are family, so we're bringing the same natural attention and care to your closest furry friends. Burt's Bees Natural Pet Care now brings nature's solutions to our beloved pets with a specially formulated line of natural grooming products including shampoos, conditioner, sprays, wipes, and treatments. Burt's Bees Natural Pet Care products are made using 80% post-consumer recycled bottles. Tap into nature's power with Burt's Bees Dander Reducing Wipes for Cats. These effective cat wipes for dander and grooming calm your companion's coat with nature's finest ingredients. This naturally nourishing formula taps into aloe vera's natural ability to ease irritation and soothe dry skin. Burt's Bees wipes for cats help you groom your pet with gentle, natural ingredients that keep your kitten or cat naturally fresh. It's made with some of nature's finest ingredients for your peace of mind and your pet's well-being. Free of colorants, these dander wipes are pH balanced for cats. As is typical with natural formulas, these natural cat wipes don't have a strong scent outside of the main ingredients because we don’t add in artificial fragrances or chemicals to any of our products. Burt's Bees Natural Pet Care is made in the United States without parabens, phthalates, petrolatum, SLS, or synthetic fragrances. Discover nature’s best for your pets! Directions: Wipe cat from back of ears to tail, carefully avoiding eyes. Great for spot cleaning and paw cleaning.","productURL":"https://www.amazon.com/dp/B073J5C6H2?ref=myi_title_dp","productImages":["https://drive.google.com/drive/folders/1l8GSbi3K4tFPQON1TGkyr1biP3rygQH6?usp=sharing"],"img":"https://i.ibb.co/f2yK2n5/Bees.jpg"},{"category":"Pet Supplies","brand":"PrettyLitter ","productName":"PrettyLitter Lotus Flower Scented Health Monitoring Cat Pet Litter (8 lbs) ","priceRange":"25-30","itemCode":"Item # PL129","quantity":"130","minimumOrder":"10","description":"Lotus Flower Scented PrettyLitter is the world’s most intelligent cat litter. It has absorbent, non-clumping crystals that lock in odor and moisture, and real lotus flower extracts that give a pleasant, floral scent. It works well for single and multiple-cat households, and it changes color to help you keep track of your cat’s health. It can alert you to potential problems such as urinary tract infections (UTIs), bladder inflammation, urinary stones, and blood in the urine. One 8lb. bag of PrettyLitter lasts for about two months and saves you from carrying heavy cat litter. PrettyLitter’s low-dust formula is ideal for cat owners who have asthma. The super absorbent crystals eliminate liquid, so you only have to scoop the poop, which means less work and less waste. The long-lasting, non-clumping litter also means lighter trash bags, less scooping and less trips to the store. This lightweight, health-monitoring litter is designed to make cat parenting easier and less stressful, so you can focus on what matters most — enjoying a long and happy life with your cat.","productURL":"https://www.amazon.com/dp/B0CDS57NMS?ref=myi_title_dp","productImages":["https://drive.google.com/drive/folders/1gBD1vi8hTMtHMjZVxAduqrc5x8Ysb_XY?usp=drive_link"],"img":"https://i.ibb.co/bs9cQCY/51-FA6-TTFda-L-AC-SX679.jpg"},{"category":"Pet Supplies","brand":"PrettyLitter ","productName":"PrettyLitter Unscented Health Monitoring Cat Pet Litter (8 lbs) ","priceRange":"25-30","itemCode":"Item # PL130","quantity":"80","minimumOrder":"10","description":"Introducing PrettyLitter, the ultimate innovation in cat litter technology. Our revolutionary non-clumping crystals are designed to provide unbeatable odor control and moisture absorption, catering to both single and multi-cat households. Unlike traditional litters, PrettyLitter's absorbent crystals instantly lock away odors and moisture, ensuring a fresher and more pleasant environment for both you and your feline companions. But that's not all – this game-changing cat litter goes beyond the ordinary. One 8lb. bag of PrettyLitter is all you need to enjoy approximately 2 months of worry-free litter management. No more struggling with heavy bags of litter or frequent trips to the store. Its lightweight nature saves you the hassle and strain, making cat ownership even more enjoyable. But what truly sets PrettyLitter apart is its remarkable health-monitoring feature. Through its innovative color-changing formula, this litter can actually provide insights into your cat's well-being. By detecting changes in urine pH and composition, it's a valuable tool in identifying potential health issues such as urinary tract infections, bladder inflammation, urinary stones, and even the presence of blood in the urine. Your cat's health matters, and PrettyLitter ensures you stay informed. Not only is PrettyLitter's low-dust formula beneficial for cats with asthma, but its super absorbent crystals also eliminate liquids, leaving you with only the task of scooping solid waste. This translates to easy maintenance and less litter wastage, saving you both time and effort. With PrettyLitter, say goodbye to clumping litters that create heavy trash bags and require excessive scooping. Our non-clumping formula guarantees lighter bags and a reduced need for store visits, giving you more quality time with your furry friends. Embrace the future of cat parenting with PrettyLitter – a lightweight, health-conscious solution that allows you to prioritize what truly matters: enjoying a long.","productURL":"https://www.amazon.com/dp/B0CG3LTZ3Q?ref=myi_title_dp","productImages":["https://drive.google.com/drive/folders/1ZofIMC0AHDszvYFuZKv66tpZtqk9cBXC?usp=drive_link"],"img":"https://i.ibb.co/9901Wsq/41mb-Y9-Vp-Ja-L-AC.jpg"},{"category":"Pet Supplies","brand":"PURINA ","productName":"PURINA ALPO Dental Chews - Daily Dental Dog Snacks 21OZ ","priceRange":"35-41","itemCode":"Item # ADG11","quantity":"170","minimumOrder":"10","description":"Brand: Purina ALPO Brand Dog FoodAge Range (Description): All Life StagesItem Form: StickUnit Count: 21 Ounce Number of Items: 1","productURL":"https://www.amazon.com/dp/B07VGS8RBV?ref=myi_title_dp","productImages":["https://drive.google.com/file/d/14EPU8tRMMV6x7SJrAv92YL_dxByEw-U5/view?usp=sharing"],"img":"https://i.ibb.co/3YfTR4t/B07-VGS8-RBV.jpg"},{"category":"Pet Supplies","brand":"Bonkers ","productName":"Bonkers Cat Treats: Irresistible Crunchy and Soft Seafood Flavors - 12oz","priceRange":"6.48-9","itemCode":"Item # ADG17","quantity":"170","minimumOrder":"10","description":"Indulge your feline friend in a world of oceanic delight with Bonkers Cat Treats in the irresistible Seafood & Eat It! flavor. This 12oz bag is a treasure trove of delectable goodies specially crafted for your beloved cat's cravings. Our cat treats offer the perfect combination of satisfying crunchiness and tender softness, making each bite a delightful adventure for your furry companion. The tantalizing seafood flavors within each piece are sure to whisk your cat away on a flavorful voyage. Made with high-quality ingredients, these treats are not only scrumptious but also packed with essential nutrients to support your cat's overall health and well-being. Whether you use them as a training reward or simply as an occasional treat, Bonkers Cat Treats are the perfect way to show your cat some extra love. Spoil your cat with the flavors of the sea they've been dreaming of. Treat them to Bonkers Cat Treats today and watch their tails wag with joy. Because when it comes to pampering your feline friend, nothing beats the enchanting allure of our Seafood & Eat It! flavor.","productURL":"https://www.amazon.com/dp/B0CJ842V9V?ref=myi_title_dp","productImages":["https://prnt.sc/KQBt29owUM2B","https://prnt.sc/5Cht_GHsX_yW","https://prnt.sc/KeUNlEu4ipA3","https://prnt.sc/EGGd7vrp1fgn"],"img":"https://i.ibb.co/VT8jgZM/oa61-X6-S0-Qh6-Rd9k-JMYh-Nd-A.png"},{"category":"Pet Supplies","brand":"Special Kitty ","productName":"Special Kitty Fresh Scent Premium Clay Cat Litter, 25 Lb","priceRange":"6.73-10","itemCode":"Item # ADG24","quantity":"140","minimumOrder":"15","description":"Special Kitty Fresh Scent Premium Clay Cat Litter, 25 Lb:Highly AbsorbentFresh Clean Scent99 Dust FreeNatural Clay Product","productURL":"https://www.amazon.com/dp/B079ZCYM6J?ref=myi_title_dp","productImages":["https://prnt.sc/sqM2p9aolZTf"],"img":"https://i.ibb.co/pf75151/f-JZ-h-Ry-RAKa9sck-zg-Oj-A.png"},{"category":"Pet Supplies","brand":"Cheristin","productName":"Cheristin For Cats - 6pk by Lilly by Elanco Animal Health ","priceRange":"41-45","itemCode":"Item # ADG55","quantity":"195","minimumOrder":"10","description":"Brand new in packages!!!","productURL":"https://www.amazon.com/dp/B01MQ4GKGP?ref=myi_title_dp","productImages":["https://drive.google.com/file/d/1lGt0kFrHObmvMDw0U1yBI0MUkb2J1K7S/view?usp=sharing"],"img":"https://i.ibb.co/NmhtY8v/51bh86i-UML-AC-SY300-SX300-QL70-FMwebp-1.webp"},{"category":"Pet Supplies","brand":"Canine Carry Outs","productName":"Canine Carry Outs Beef Flavor Dog Treats, 50 Ounce Bag (Discontinued by Manufacturer) ","priceRange":"7.52-11","itemCode":"Item # ADG92","quantity":"100","minimumOrder":"20","description":"Your dog loves The snacks you carry home in a doggie bag. So reward him every day with Canine Carry Outs beef flavor chewy snacks for dogs!","productURL":"https://www.amazon.com/dp/B00CEB1ITU?ref=myi_title_dp&th=1","productImages":["https://drive.google.com/drive/folders/16kgz45D6sqlXsWQsg9FJQ_oSfB7_t0NE?usp=sharing"],"img":"https://i.ibb.co/rxLJmpZ/812s-BUa-I3-SL-AC-SL1500.jpg"},{"category":"Pet Supplies","brand":"Tuwicx","productName":"Tuwicx Interactive Dog/Cat Toys for Boredom and Stimulating, Durable Motion Activated Automatic Rolling Ball Toys for Puppy/Small/Medium Dogs ","priceRange":"72.88-76","itemCode":"Item # ADG106","quantity":"120","minimumOrder":"5","description":"3.15 x 3.15 x 3.15 inche","productURL":"https://www.amazon.com/dp/B0BQVD7TM5?ref=myi_title_dp","productImages":["https://prnt.sc/unybNF1MxJ3V"],"img":"https://i.ibb.co/61sCBS9/x5-PDe8i-HRAW-ZB5pf4sn-Yw.png"},{"category":"Pet Supplies","brand":" Harness Lead","productName":"Harness Lead No Pull Dog Harness and Leash Set, Anti Pull Dog Harness for All Breeds and Sizes, One-Piece Cushioned Rope Design Safely Prevents Escaping and Pulling (Medium/Large, Blue/Multi) ","priceRange":"54-58","itemCode":"Item # ADG108","quantity":"120","minimumOrder":"10","description":"10.5 x 5.4 x 1.7 inches","productURL":"https://www.amazon.com/dp/B07ND5R4C5?ref=myi_title_dp","productImages":["https://prnt.sc/x0FXhBhWAJiY"],"img":"https://i.ibb.co/HH999xC/jw-W0-Miyp-RDC8-HTqo-PKl72-Q.png"},{"category":"Pet Supplies","brand":"W F Young","productName":"Absorbine Veterinary Liniment Gel, 12-Ounce by Absorbine ","priceRange":"20-25","itemCode":"Item # ADG143","quantity":"70","minimumOrder":"10","description":"Legs: To relieve pain And reduce swelling Of the legs, rub absorbine gelin thoroughly three or more times a day. To speed effectiveness, applygel with the lay Of the hair And lightly wrap. Absorbine gel is alsoeffective for pre-workout rubs And post-workout setup wraps. Back,shoulder, And flank: for relief Of soreness And stiffness, rub absorbinegel in thoroughly. Apply three or more times a day. Do not apply gelunder the saddle area if you're going To ride the horse after treatment.Shipping: during transportation, many horses injure their lower legs inthe tailer or they stock up From prolonged standing. Shipping wrapsare recommended To prevent injuries And absorbine gel is safe andeffective under porous wraps in reducing swelling. Arthritis: a commoncondition in older horses, absorbine gel helps To loosen stiff,arthritic joints And reduce the pain And swelling","productURL":"https://www.amazon.com/gp/product/B01M5FJ54F","productImages":["https://prnt.sc/TsCVaPQAKcbH"],"img":"https://i.ibb.co/DrbxDF6/Lmm4ymky-Rw-Oz64vlk-Iq-Oag.png"},{"category":"Pet Supplies","brand":"Espree ","productName":"Espree Puppy Waterless Bath, 24 oz ","priceRange":"13-15","itemCode":"Item # ADG146","quantity":"70","minimumOrder":"10","description":"Removes Dirt, Stains, & Odor Quick & Gentle Cleanup for Your Puppy. Tear Fee Made with 100% Organically Grown Aloe Vera Made in the USA ","productURL":"https://www.amazon.com/gp/product/B014UUYSY4","productImages":["https://prnt.sc/tg_oMudoW7M-"],"img":"https://i.ibb.co/gVTdvkx/XHEDC90y-Rt-OQA1-MXGUg8-w.png"},{"category":"Pet Supplies","brand":"Instant Ocean ","productName":"Instant Ocean Reef Crystals Reef Salt For 50 Gallons, Enriched Formulation For aquariums ","priceRange":"6.48-9","itemCode":"Item # IOR158","quantity":"85","minimumOrder":"10","description":"Contains essential ocean reef elements in concentrations greater than those found in natural sea water Recommended specific gravity range – 1.020-1.026 at 77ᵒ F | Note – 1.4 lbs. of Reef Crystals is formulated to create 5 gallons of saltwater at a specific gravity of 1.021 Our marine salt will typically set the pH of a tank between 8.0 and 8.3 while it produces between 7 and 10 dKH ","productURL":"https://www.amazon.com/gp/product/B000HCLNR0","productImages":["https://prnt.sc/KoZRxoFK707t"],"img":"https://i.ibb.co/vH3gMZ8/y-TQp0-U6k-R8-Oo-JYVotpxod-A.png"},{"category":"Pet Supplies","brand":"PetAg","productName":"PetAg Prozyme Powder - Digestive Enzyme Supplement for Lactose Intolerant Dogs and Cats - All Natural Health Supplement Formula - 300 g Powder","priceRange":"5-7","itemCode":"Item # PPP178","quantity":"70","minimumOrder":"15","description":"Prozyme Powder: All natural health supplement formula with digestive enzymes for dogs and cats","productURL":"https://www.amazon.com/Prozyme-All-Natural-Enzyme-Supplement-Lactose/dp/B002LVTKAW/ref=sr_1_fkmr0_1?crid=1PK0XT9HVAKOQ&keywords=Prozyme%2BPowder%2C%2B85g&qid=1695287598&sprefix=prozyme%2Bpowder%2C%2B85g%2Caps%2C714&sr=8-1-fkmr0&th=1","productImages":["https://drive.google.com/file/d/1hHi4oXtm0PRryfQzD3F-sAF0xXPAKG1p/view?usp=sharing"],"img":"https://i.ibb.co/VNzbGz1/71-EM2h-SLh3-L-AC-SY879.jpg"},{"category":"Pet Supplies","brand":"PETSPIONEER","productName":"PETSPIONEER Reptile Humidifier Digital Timing Fog Machine with Double Hose & 4 Liter Reservoir, Automatic Terrarium Fogger for Reptiles/Amphibians/Herps/Vivarium","priceRange":"20-22","itemCode":"Item # PRH215","quantity":"165","minimumOrder":"10","description":"Smart Reptile Humidifier Fogger, Digital Timing Reptile Mister with LED Indicator, Automatic Adjustable Terrarium Humidifier, Easy & Quiet Operation, Double Extension Tube, 4 Liter Tank","productURL":"https://www.amazon.com/dp/B07V39ZYJB?ref=myi_title_dp","productImages":["https://drive.google.com/file/d/1da7H3XH4IYiOXCNEy_1npEVhnfJthbkW/view?usp=sharing"],"img":"https://i.ibb.co/f49jzGt/h-C5-TO2-I6-R2iz5ys-QZb-N3d-Q.png"}],"name":"Pet Supplies"},"__N_SSG":true}