{"pageProps":{"products":[{"category":"Shampoo","brand":"MODAMODA","productName":"[MODAMODA] Naturally Grey Reducing Shampoo, Darkening Gray Hair, Minimizing Hair Loss, and Boosting Hair Volume 300g (Pack of 1) ","priceRange":"20-25","itemCode":"Item # MN110","quantity":"120","minimumOrder":"10","description":"3.15 x 3.15 x 10.62 inches;","productURL":"https://www.amazon.com/dp/B0B2FKMFQ8?ref=myi_title_dp","productImages":["https://drive.google.com/drive/folders/1GjS2FEG_Wmxpbk890fQlV5LEIuM6klV8?usp=sharing"],"img":"https://i.ibb.co/SQnZs8G/MODAMODA.jpg"},{"category":"Shampoo","brand":"Johnson's Baby","productName":"Johnson's Baby Shampoo with Tear-Free Formula, Shampoo for Baby's Delicate Scalp & Skin, Gently Washes Away Dirt & Germs, Paraben-, Phthalate-, Sulfate- & Dye-Free, 13.6 fl. oz, Pack of 3 ","priceRange":"3-5","itemCode":"Item # JB111","quantity":"120","minimumOrder":"10","description":"Johnson's Baby Shampoo provides a mild, gentle clean that won't irritate your baby's eyes during bath time. Specially formulated for fine baby hair and delicate scalp, this gentle cleansing baby shampoo gently washes away dirt and germs as it leaves your little one's hair soft, shiny, clean and smelling baby fresh. The Johnson's No More Tears formula is as gentle to the eyes as pure water and won't irritate baby's eyes during bath time. This tear-free hair shampoo is hypoallergenic, pediatrician-tested, and free of parabens, phthalates, sulfates, and dyes. To use, wet baby's hair with warm water, apply shampoo, gently lather, and rinse. For over 125 years, Johnson's formulas have been specially designed for baby's unique and delicate skin and hair. We collaborated with and listened to 11,500 parents, midwives, and pediatricians around the world.","productURL":"https://www.amazon.com/dp/B08YP6KKP6?ref=myi_title_dp","productImages":["https://drive.google.com/drive/folders/1D1gNHzx65Hl2w0NxU9ob4_eujQLFGdmE?usp=sharing"],"img":"https://i.ibb.co/dKVQxKR/9-Of-WP0oe-RAe-Jb9-Rz-gu-Jpg.png"},{"category":"Shampoo","brand":"Kitsch ","productName":"Kitsch Castor Oil Shampoo Bar for Hair Growth | Bottle-free Eco-friendly | Soap Bar Shampoo Hydrates & Moisturizes Dull and Dry Hair | All-Natural Chemical-free Daily Shampoo Softens & Strengthens ","priceRange":"9.98","itemCode":"Item # GFM294","quantity":"80","minimumOrder":"20","description":"HIGH-QUALITY HAIR CARE: Formulated with Castor Oil, pure essential oils and bio-based ingredients that perfectly balance the PH in your hair, Kitsch Pro’s Castor Oil Nourishing Shampoo Bar provides a salon-quality experience from root to tip. HEALTHY RESULTS: Nourishing and moisturizing your strands, the ingredients in this Castor Oil Bar Shampoo will make your hair soft and strong to deliver healthy-looking locks with a great shine. This soap bar for hair also makes hair easier to detangle so there’s less breakage. NO HARSH INGREDIENTS: Kitsch Hair Soap Bar is free of sulfates, parabens, phthalates, silicones, and artificial fragrances and dye to minimize irritation, making it gentle enough for washing your hair on a daily basis.","productURL":"https://www.amazon.com/dp/B0B1HFS86F?ref=myi_title_dp","productImages":["https://drive.google.com/drive/folders/1NdhOMcSXZrrNpWDFzsSssCGuzeVKQdwk?usp=sharing"],"img":"https://i.ibb.co/9rxg7j2/71-Ehl-Ei-Pho-L-SL1250.jpg"}],"name":"Shampoo"},"__N_SSG":true}